Revit 2026 API

# PDFExportQualityType Enumeration

---

An enumerated type listing the options for PDF export quality.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PDFExportQualityType
```
```vb
Public Enumeration PDFExportQualityType
```
```cpp
public enum class PDFExportQualityType
```
```fsharp
type PDFExportQualityType
```

| Member name | Value | Description |
| --- | --- | --- |
| DPI1200 | 1,200 |  |
| DPI144 | 144 |  |
| DPI2400 | 2,400 |  |
| DPI300 | 300 |  |
| DPI3600 | 3,600 |  |
| DPI4000 | 4,000 |  |
| DPI600 | 600 |  |
| DPI72 | 72 |  |

#### Reference

Autodesk.Revit.DB Namespace